app/views/books/_form.html.erb

      <div class="field">
        <%= f.collection_select :genre_id, Genre.order(:name),:id,:name , label: "Género" %>
---
SELECT "genres".* FROM "genres"  ORDER BY "genres"."name" ASC