app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.stock = 0
    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("name", "price", "writer", "editorial", "genre_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "avatar_file_name" = $1, "avatar_file_size" = $2, "avatar_updated_at" = $3, "updated_at" = $4 WHERE "books"."id" = $5  [["avatar_file_name", "piedra_filosofal.jpg"], ["avatar_file_size", 42584], ["avatar_updated_at", "2016-12-29 17:01:01.837698"], ["updated_at", "2016-12-29 17:01:01.984313"], ["id", 1]]