app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "trademark", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Block Medium 99 1/8 20 h"], ["price", 1190], ["trademark", "Artel"], ["created_at", "2016-12-29 21:20:44.348139"], ["updated_at", "2016-12-29 21:20:44.348139"]]
---
  def create
    @product = Product.new(product_params)
    @product.stock = 0
    respond_to do |format|
      if @product.save

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]
---
  def destroy
    @purchases = Purchase.where(product_barcode: @product.barcode)
    @purchases.each do |purchase|
      purchase.destroy
    end
    @sales = Sale.where(product_barcode: @product.barcode)
    @sales.each do |sale|
      sale.destroy
    end
    @product.destroy