app/controllers/sales_controller.rb

SELECT "sales".* FROM "sales"
---
  def index
    @sales = Sale.all.includes(:user)