app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password", "phone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "benises"], ["password", "123456"], ["phone", 28899171], ["email", "asdf@fdsa.com"], ["created_at", "2016-12-09 15:18:21.917866"], ["updated_at", "2016-12-09 15:18:21.917866"]]
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save(user_params)